Revit 2026 API

# RebarTrimExtendDataAddBarGeometry(IListCurve) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve> curves
)
```
```vb
Public Function AddBarGeometry (
	curves As IList(Of Curve)
) As RebarFreeFormValidationResult
```
```cpp
public:
RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve^>^ curves
)
```
```fsharp
member AddBarGeometry :
        curves : IList<Curve> -> RebarFreeFormValidationResult
```

#### Parameters

curves IListCurve

#### Return Value

RebarFreeFormValidationResult

#### Reference

RebarTrimExtendData Class

AddBarGeometry Overload

Autodesk.Revit.DB.Structure Namespace